abruptContraction/interPhaseChangeFoam/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  3.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application             interPhaseChangeFoam;

startFrom               latestTime;

startTime               0;

stopAt                  endTime;

endTime                 0.8;

deltaT                  1e-8;

writeControl            adjustableRunTime;

writeInterval           0.001;

purgeWrite              0;

writeFormat             ascii;

writePrecision          6;

writeCompression        uncompressed;

timeFormat              general;

runTimeModifiable       yes;

adjustTimeStep          on;

maxCo                   5;


// ************************************************************************* //
